app/Controllers/Home.php

    public function dashboard()
    {
        if (session('logged_in') != true) {
            return redirect()->to(base_url('/'));
        }
        $KipasAnginStatus = $this->KipasAnginModel->orderBy('id', 'ASC')->first();
        $dataSuhu = $this->SuhuModel->findAll();
        $dataKipasAngin = $this->KipasAnginModel->findAll();
---
SELECT *
FROM `kipas_angin`
ORDER BY `id` ASC
 LIMIT 1
SELECT *
FROM `suhu`
SELECT *
FROM `kipas_angin`

    public function authenticate()
    {
        $model = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1

    public function toggleFan()
    {
        $KipasAnginStatus = $this->KipasAnginModel->orderBy('id', 'DESC')->first();
        if ($KipasAnginStatus['status'] == 'off') {
            $newStatus = 'on';
        } else {
            $newStatus = 'off';
        }
        $this->KipasAnginModel->insert([
            'status' => $newStatus,
            'timestamp' => date('Y-m-d H:i:s'), // Waktu sekarang
        ]);
---
SELECT *
FROM `kipas_angin`
ORDER BY `id` DESC
 LIMIT 1
INSERT INTO `kipas_angin` (`status`, `timestamp`) VALUES ('off', '2024-09-22 11:43:21')